; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-4-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p0-4 - location
	p1-2 - location
	p3-0 - location
	p3-1 - location
	p4-0 - location
	p4-1 - location
	p4-5 - location
	p5-0 - location
	p5-1 - location
	p5-2 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s3)
	(at package2 s0)
	(at package3 s4)
	(at package4 s0)
	(at package5 s0)
	(at package6 s1)
	(at package7 s4)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 50)
	(= (time-to-walk p0-3 s0) 50)
	(= (time-to-walk s3 p0-3) 14)
	(= (time-to-walk p0-3 s3) 14)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 58)
	(= (time-to-walk p0-4 s0) 58)
	(= (time-to-walk s4 p0-4) 48)
	(= (time-to-walk p0-4 s4) 48)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 4)
	(= (time-to-walk p1-2 s1) 4)
	(= (time-to-walk s2 p1-2) 33)
	(= (time-to-walk p1-2 s2) 33)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 46)
	(= (time-to-walk p3-1 s3) 46)
	(= (time-to-walk s1 p3-1) 42)
	(= (time-to-walk p3-1 s1) 42)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 9)
	(= (time-to-walk p4-1 s4) 9)
	(= (time-to-walk s1 p4-1) 46)
	(= (time-to-walk p4-1 s1) 46)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 1)
	(= (time-to-walk p4-5 s4) 1)
	(= (time-to-walk s5 p4-5) 3)
	(= (time-to-walk p4-5 s5) 3)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 61)
	(= (time-to-walk p5-0 s5) 61)
	(= (time-to-walk s0 p5-0) 13)
	(= (time-to-walk p5-0 s0) 13)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 34)
	(= (time-to-walk p5-1 s5) 34)
	(= (time-to-walk s1 p5-1) 62)
	(= (time-to-walk p5-1 s1) 62)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 82)
	(= (time-to-walk p5-2 s5) 82)
	(= (time-to-walk s2 p5-2) 88)
	(= (time-to-walk p5-2 s2) 88)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 28)
	(= (time-to-drive s1 s0) 28)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 86)
	(= (time-to-drive s3 s0) 86)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 6)
	(= (time-to-drive s4 s0) 6)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 61)
	(= (time-to-drive s0 s2) 61)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 87)
	(= (time-to-drive s3 s2) 87)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 71)
	(= (time-to-drive s5 s2) 71)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 8)
	(= (time-to-drive s1 s3) 8)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 11)
	(= (time-to-drive s2 s4) 11)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 80)
	(= (time-to-drive s3 s4) 80)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 39)
	(= (time-to-drive s1 s5) 39)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 80)
	(= (time-to-drive s3 s5) 80)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 1)
	(= (time-to-drive s4 s5) 1)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver3 s5)
	(at truck1 s4)
	(at truck2 s2)
	(at truck3 s4)
	(at package1 s5)
	(at package3 s3)
	(at package4 s1)
	(at package5 s3)
	(at package6 s0)
	(at package7 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver3 s2 p5-2)
   deleted: (at driver3 s2)
   added: (at driver3 p5-2)
   changed: (walked) from 0 to 88
   goals met: 1 of 11
2. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 1 of 11
3. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 0 to 61
   goals met: 1 of 11
4. (load-truck package4 truck4 s0)
   deleted: (at package4 s0)
   added: (in package4 truck4)
   goals met: 1 of 11
5. (load-truck package5 truck4 s0)
   deleted: (at package5 s0)
   added: (in package5 truck4)
   goals met: 1 of 11
6. (walk driver3 p5-2 s5)
   deleted: (at driver3 p5-2)
   added: (at driver3 s5)
   changed: (walked) from 88 to 170
   goals met: 2 of 11
7. (drive-truck truck4 s0 s1 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 61 to 89
   goals met: 2 of 11
8. (unload-truck package4 truck4 s1)
   deleted: (in package4 truck4)
   added: (at package4 s1)
   goals met: 3 of 11
9. (load-truck package6 truck4 s1)
   deleted: (at package6 s1)
   added: (in package6 truck4)
   goals met: 3 of 11
10. (drive-truck truck4 s1 s0 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 89 to 117
   goals met: 3 of 11
11. (unload-truck package6 truck4 s0)
   deleted: (in package6 truck4)
   added: (at package6 s0)
   goals met: 4 of 11
12. (drive-truck truck4 s0 s3 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (driven) from 117 to 203
   goals met: 4 of 11
13. (unload-truck package5 truck4 s3)
   deleted: (in package5 truck4)
   added: (at package5 s3)
   goals met: 5 of 11
14. (load-truck package1 truck4 s3)
   deleted: (at package1 s3)
   added: (in package1 truck4)
   goals met: 5 of 11
15. (drive-truck truck4 s3 s5 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   changed: (driven) from 203 to 283
   goals met: 5 of 11
16. (unload-truck package1 truck4 s5)
   deleted: (in package1 truck4)
   added: (at package1 s5)
   goals met: 6 of 11
17. (drive-truck truck4 s5 s3 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (driven) from 283 to 363
   goals met: 6 of 11
18. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 11
19. (drive-truck truck4 s3 s0 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (driven) from 363 to 449
   goals met: 5 of 11
20. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 5 of 11
21. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 11
22. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 449 to 455
   goals met: 6 of 11
23. (load-truck package3 truck1 s4)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 6 of 11
24. (drive-truck truck1 s4 s3 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (driven) from 455 to 535
   goals met: 5 of 11
25. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   goals met: 6 of 11
26. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 535 to 615
   goals met: 7 of 11
27. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 615 to 621
   goals met: 6 of 11
28. (drive-truck truck2 s5 s4 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 621 to 622
   goals met: 6 of 11
29. (load-truck package7 truck2 s4)
   deleted: (at package7 s4)
   added: (in package7 truck2)
   goals met: 6 of 11
30. (drive-truck truck2 s4 s2 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (driven) from 622 to 633
   goals met: 7 of 11
31. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 633 to 694
   goals met: 7 of 11
32. (drive-truck truck2 s2 s5 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (driven) from 694 to 765
   goals met: 6 of 11
33. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 7 of 11
34. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 11
35. (unload-truck package7 truck2 s5)
   deleted: (in package7 truck2)
   added: (at package7 s5)
   goals met: 6 of 11
36. (load-truck package7 truck3 s5)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   goals met: 6 of 11
37. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 765 to 804
   goals met: 6 of 11
38. (unload-truck package7 truck3 s1)
   deleted: (in package7 truck3)
   added: (at package7 s1)
   goals met: 7 of 11
39. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 804 to 832
   goals met: 7 of 11
40. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 832 to 903
   goals met: 7 of 11
41. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 7 of 11
42. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 7 of 11
43. (walk driver3 s0 p5-0)
   deleted: (at driver3 s0)
   added: (at driver3 p5-0)
   changed: (walked) from 170 to 183
   goals met: 7 of 11
44. (walk driver3 p5-0 s5)
   deleted: (at driver3 p5-0)
   added: (at driver3 s5)
   changed: (walked) from 183 to 244
   goals met: 8 of 11
45. (walk driver2 s5 p5-0)
   deleted: (at driver2 s5)
   added: (at driver2 p5-0)
   changed: (walked) from 244 to 305
   goals met: 8 of 11
46. (board-truck driver3 truck1 s5)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 11
47. (walk driver2 p5-0 s5)
   deleted: (at driver2 p5-0)
   added: (at driver2 s5)
   changed: (walked) from 305 to 366
   goals met: 7 of 11
48. (drive-truck truck1 s5 s4 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 903 to 904
   goals met: 8 of 11
49. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 904 to 910
   goals met: 7 of 11
50. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 11
51. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 7 of 11
52. (walk driver3 s0 p5-0)
   deleted: (at driver3 s0)
   added: (at driver3 p5-0)
   changed: (walked) from 366 to 379
   goals met: 7 of 11
53. (walk driver3 p5-0 s5)
   deleted: (at driver3 p5-0)
   added: (at driver3 s5)
   changed: (walked) from 379 to 440
   goals met: 8 of 11
54. (walk driver1 s3 p0-3)
   deleted: (at driver1 s3)
   added: (at driver1 p0-3)
   changed: (walked) from 440 to 454
   goals met: 7 of 11
55. (walk driver1 p0-3 s0)
   deleted: (at driver1 p0-3)
   added: (at driver1 s0)
   changed: (walked) from 454 to 504
   goals met: 7 of 11
56. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 11
57. (drive-truck truck3 s0 s3 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 910 to 996
   goals met: 7 of 11
58. (walk driver3 s5 p5-0)
   deleted: (at driver3 s5)
   added: (at driver3 p5-0)
   changed: (walked) from 504 to 565
   goals met: 6 of 11
59. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (driven) from 996 to 1067
   goals met: 7 of 11
60. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 8 of 11
61. (walk driver3 p5-0 s0)
   deleted: (at driver3 p5-0)
   added: (at driver3 s0)
   changed: (walked) from 565 to 578
   goals met: 8 of 11
62. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 11
63. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 8 of 11
64. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 8 of 11
65. (walk driver3 s0 p5-0)
   deleted: (at driver3 s0)
   added: (at driver3 p5-0)
   changed: (walked) from 578 to 591
   goals met: 8 of 11
66. (walk driver3 p5-0 s5)
   deleted: (at driver3 p5-0)
   added: (at driver3 s5)
   changed: (walked) from 591 to 652
   goals met: 9 of 11
67. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 8 of 11
68. (drive-truck truck3 s3 s4 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 1067 to 1147
   goals met: 9 of 11
69. (drive-truck truck3 s4 s0 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (driven) from 1147 to 1153
   goals met: 8 of 11
70. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 8 of 11
71. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   changed: (walked) from 652 to 702
   goals met: 8 of 11
72. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   changed: (walked) from 702 to 716
   goals met: 9 of 11
73. (walk driver3 s5 p5-0)
   deleted: (at driver3 s5)
   added: (at driver3 p5-0)
   changed: (walked) from 716 to 777
   goals met: 8 of 11
74. (walk driver3 p5-0 s0)
   deleted: (at driver3 p5-0)
   added: (at driver3 s0)
   changed: (walked) from 777 to 790
   goals met: 8 of 11
75. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 8 of 11
76. (drive-truck truck3 s0 s4 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (driven) from 1153 to 1159
   goals met: 9 of 11
77. (drive-truck truck3 s4 s5 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 1159 to 1160
   goals met: 8 of 11
78. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 9 of 11
79. (walk driver3 s5 p5-0)
   deleted: (at driver3 s5)
   added: (at driver3 p5-0)
   changed: (walked) from 790 to 851
   goals met: 8 of 11
80. (walk driver3 p5-0 s0)
   deleted: (at driver3 p5-0)
   added: (at driver3 s0)
   changed: (walked) from 851 to 864
   goals met: 8 of 11
81. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 11
82. (walk driver2 s2 p5-2)
   deleted: (at driver2 s2)
   added: (at driver2 p5-2)
   changed: (walked) from 864 to 952
   goals met: 8 of 11
83. (walk driver2 p5-2 s5)
   deleted: (at driver2 p5-2)
   added: (at driver2 s5)
   changed: (walked) from 952 to 1034
   goals met: 8 of 11
84. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 11
85. (drive-truck truck3 s5 s4 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 1160 to 1161
   goals met: 9 of 11
86. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 9 of 11
87. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 9 of 11
88. (walk driver3 s0 p5-0)
   deleted: (at driver3 s0)
   added: (at driver3 p5-0)
   changed: (walked) from 1034 to 1047
   goals met: 9 of 11
89. (walk driver3 p5-0 s5)
   deleted: (at driver3 p5-0)
   added: (at driver3 s5)
   changed: (walked) from 1047 to 1108
   goals met: 10 of 11
90. (walk driver2 s4 p0-4)
   deleted: (at driver2 s4)
   added: (at driver2 p0-4)
   changed: (walked) from 1108 to 1156
   goals met: 10 of 11
91. (walk driver2 p0-4 s0)
   deleted: (at driver2 p0-4)
   added: (at driver2 s0)
   changed: (walked) from 1156 to 1214
   goals met: 10 of 11
92. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 11
93. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 1161 to 1167
   goals met: 11 of 11
